"""
Константы конфигурации игры «Изгиб Питона».

Содержит определения размеров игрового поля, размера сетки,
направлений движения, цветов и скорости игры.
"""

# Константы для размеров поля и сетки:
SCREEN_WIDTH = 640 // 2 # Ширина игрового окна в пикселях
SCREEN_HEIGHT = 480 // 2  # Высота игрового окна в пикселях
GRID_SIZE = 20  # Размер одной ячейки сетки в пикселях
GRID_WIDTH = SCREEN_WIDTH // GRID_SIZE  # Количество ячеек по горизонтали
GRID_HEIGHT = SCREEN_HEIGHT // GRID_SIZE  # Количество ячеек по вертикали

# Направления движения (dx, dy):
UP = (0, -1)
DOWN = (0, 1)
LEFT = (-1, 0)
RIGHT = (1, 0)

# Цвета (RGB):
BOARD_BACKGROUND_COLOR = (0, 0, 0)  # Фон игрового поля — чёрный
BORDER_COLOR = (93, 216, 228)  # Цвет границы ячейки
APPLE_COLOR = (255, 0, 0)  # Цвет яблока — красный
SNAKE_COLOR = (0, 255, 0)  # Цвет змейки — зелёный

# Скорость игры (итераций в секунду):
SPEED = 5  # 20

if __name__ == '__main__':
    print('И зачем?)')
    raise Exception('Dummy launch.')
